name: "FPN-pva"
layer {
    name: 'input-data'
    type: 'Python'
    top: 'data'
    top: 'im_info'
    top: 'gt_boxes'
    python_param {
        module: 'roi_data_layer.layer'
        layer: 'RoIDataLayer'
        param_str: "'num_classes': 2"
    }
}

##################################################################
# convolution
##################################################################

layer {
    name: "conv1_1/conv"
    type: "Convolution"
    bottom: "data"
    top: "conv1_1/conv"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 16
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 3
        pad_w: 3
        kernel_h: 7
        kernel_w: 7
        stride_h: 2
        stride_w: 2
    }
}
layer {
    name: "conv1_1/bn"
    type: "BatchNorm"
    bottom: "conv1_1/conv"
    top: "conv1_1/conv"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv1_1/neg"
    type: "Power"
    bottom: "conv1_1/conv"
    top: "conv1_1/neg"
    power_param {
        power: 1
        scale: -1.0
        shift: 0
    }
}
layer {
    name: "conv1_1/concat"
    type: "Concat"
    bottom: "conv1_1/conv"
    bottom: "conv1_1/neg"
    top: "conv1_1"
}
layer {
    name: "conv1_1/scale"
    type: "Scale"
    bottom: "conv1_1"
    top: "conv1_1"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv1_1/relu"
    type: "ReLU"
    bottom: "conv1_1"
    top: "conv1_1"
}
layer {
    name: "pool1"
    type: "Pooling"
    bottom: "conv1_1"
    top: "pool1"
    pooling_param {
        pool: MAX
        kernel_size: 3
        stride: 2
        pad: 0
    }
}
layer {
    name: "conv2_1/1/conv"
    type: "Convolution"
    bottom: "pool1"
    top: "conv2_1/1"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 24
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_1/2/bn"
    type: "BatchNorm"
    bottom: "conv2_1/1"
    top: "conv2_1/2/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv2_1/2/bn_scale"
    type: "Scale"
    bottom: "conv2_1/2/pre"
    top: "conv2_1/2/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv2_1/2/relu"
    type: "ReLU"
    bottom: "conv2_1/2/pre"
    top: "conv2_1/2/pre"
}
layer {
    name: "conv2_1/2/conv"
    type: "Convolution"
    bottom: "conv2_1/2/pre"
    top: "conv2_1/2"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 24
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_1/3/bn"
    type: "BatchNorm"
    bottom: "conv2_1/2"
    top: "conv2_1/3/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv2_1/3/neg"
    type: "Power"
    bottom: "conv2_1/3/pre"
    top: "conv2_1/3/neg"
    power_param {
        power: 1
        scale: -1.0
        shift: 0
    }
}
layer {
    name: "conv2_1/3/concat"
    type: "Concat"
    bottom: "conv2_1/3/pre"
    bottom: "conv2_1/3/neg"
    top: "conv2_1/3/preAct"
}
layer {
    name: "conv2_1/3/scale"
    type: "Scale"
    bottom: "conv2_1/3/preAct"
    top: "conv2_1/3/preAct"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv2_1/3/relu"
    type: "ReLU"
    bottom: "conv2_1/3/preAct"
    top: "conv2_1/3/preAct"
}

layer {
    name: "conv2_1/3/conv"
    type: "Convolution"
    bottom: "conv2_1/3/preAct"
    top: "conv2_1/3"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 64
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_1/proj"
    type: "Convolution"
    bottom: "pool1"
    top: "conv2_1/proj"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 64
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_1"
    type: "Eltwise"
    bottom: "conv2_1/3"
    bottom: "conv2_1/proj"
    top: "conv2_1"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer {
    name: "conv2_2/1/bn"
    type: "BatchNorm"
    bottom: "conv2_1"
    top: "conv2_2/1/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv2_2/1/bn_scale"
    type: "Scale"
    bottom: "conv2_2/1/pre"
    top: "conv2_2/1/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv2_2/1/relu"
    type: "ReLU"
    bottom: "conv2_2/1/pre"
    top: "conv2_2/1/pre"
}
layer {
    name: "conv2_2/1/conv"
    type: "Convolution"
    bottom: "conv2_2/1/pre"
    top: "conv2_2/1"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 24
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_2/2/bn"
    type: "BatchNorm"
    bottom: "conv2_2/1"
    top: "conv2_2/2/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv2_2/2/bn_scale"
    type: "Scale"
    bottom: "conv2_2/2/pre"
    top: "conv2_2/2/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv2_2/2/relu"
    type: "ReLU"
    bottom: "conv2_2/2/pre"
    top: "conv2_2/2/pre"
}
layer {
    name: "conv2_2/2/conv"
    type: "Convolution"
    bottom: "conv2_2/2/pre"
    top: "conv2_2/2"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 24
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_2/3/bn"
    type: "BatchNorm"
    bottom: "conv2_2/2"
    top: "conv2_2/3/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv2_2/3/neg"
    type: "Power"
    bottom: "conv2_2/3/pre"
    top: "conv2_2/3/neg"
    power_param {
        power: 1
        scale: -1.0
        shift: 0
    }
}
layer {
    name: "conv2_2/3/concat"
    type: "Concat"
    bottom: "conv2_2/3/pre"
    bottom: "conv2_2/3/neg"
    top: "conv2_2/3/preAct"
}
layer {
    name: "conv2_2/3/scale"
    type: "Scale"
    bottom: "conv2_2/3/preAct"
    top: "conv2_2/3/preAct"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv2_2/3/relu"
    type: "ReLU"
    bottom: "conv2_2/3/preAct"
    top: "conv2_2/3/preAct"
}
layer {
    name: "conv2_2/3/conv"
    type: "Convolution"
    bottom: "conv2_2/3/preAct"
    top: "conv2_2/3"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 64
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_2/input"
    type: "Power"
    bottom: "conv2_1"
    top: "conv2_2/input"
    power_param {
        power: 1
        scale: 1
        shift: 0
    }
}
layer {
    name: "conv2_2"
    type: "Eltwise"
    bottom: "conv2_2/3"
    bottom: "conv2_2/input"
    top: "conv2_2"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer {
    name: "conv2_3/1/bn"
    type: "BatchNorm"
    bottom: "conv2_2"
    top: "conv2_3/1/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv2_3/1/bn_scale"
    type: "Scale"
    bottom: "conv2_3/1/pre"
    top: "conv2_3/1/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv2_3/1/relu"
    type: "ReLU"
    bottom: "conv2_3/1/pre"
    top: "conv2_3/1/pre"
}
layer {
    name: "conv2_3/1/conv"
    type: "Convolution"
    bottom: "conv2_3/1/pre"
    top: "conv2_3/1"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 24
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_3/2/bn"
    type: "BatchNorm"
    bottom: "conv2_3/1"
    top: "conv2_3/2/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv2_3/2/bn_scale"
    type: "Scale"
    bottom: "conv2_3/2/pre"
    top: "conv2_3/2/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv2_3/2/relu"
    type: "ReLU"
    bottom: "conv2_3/2/pre"
    top: "conv2_3/2/pre"
}
layer {
    name: "conv2_3/2/conv"
    type: "Convolution"
    bottom: "conv2_3/2/pre"
    top: "conv2_3/2"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 24
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_3/3/bn"
    type: "BatchNorm"
    bottom: "conv2_3/2"
    top: "conv2_3/3/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv2_3/3/neg"
    type: "Power"
    bottom: "conv2_3/3/pre"
    top: "conv2_3/3/neg"
    power_param {
        power: 1
        scale: -1.0
        shift: 0
    }
}
layer {
    name: "conv2_3/3/concat"
    type: "Concat"
    bottom: "conv2_3/3/pre"
    bottom: "conv2_3/3/neg"
    top: "conv2_3/3/preAct"
}
layer {
    name: "conv2_3/3/scale"
    type: "Scale"
    bottom: "conv2_3/3/preAct"
    top: "conv2_3/3/preAct"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv2_3/3/relu"
    type: "ReLU"
    bottom: "conv2_3/3/preAct"
    top: "conv2_3/3/preAct"
}
layer {
    name: "conv2_3/3/conv"
    type: "Convolution"
    bottom: "conv2_3/3/preAct"
    top: "conv2_3/3"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 64
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv2_3/input"
    type: "Power"
    bottom: "conv2_2"
    top: "conv2_3/input"
    power_param {
        power: 1
        scale: 1
        shift: 0
    }
}
layer {
    name: "conv2_3"
    type: "Eltwise"
    bottom: "conv2_3/3"
    bottom: "conv2_3/input"
    top: "conv2_3"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer {
    name: "conv3_1/1/bn"
    type: "BatchNorm"
    bottom: "conv2_3"
    top: "conv3_1/1/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_1/1/bn_scale"
    type: "Scale"
    bottom: "conv3_1/1/pre"
    top: "conv3_1/1/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_1/1/relu"
    type: "ReLU"
    bottom: "conv3_1/1/pre"
    top: "conv3_1/1/pre"
}
layer {
    name: "conv3_1/1/conv"
    type: "Convolution"
    bottom: "conv3_1/1/pre"
    top: "conv3_1/1"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 48
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 2
        stride_w: 2
    }
}
layer {
    name: "conv3_1/2/bn"
    type: "BatchNorm"
    bottom: "conv3_1/1"
    top: "conv3_1/2/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_1/2/bn_scale"
    type: "Scale"
    bottom: "conv3_1/2/pre"
    top: "conv3_1/2/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_1/2/relu"
    type: "ReLU"
    bottom: "conv3_1/2/pre"
    top: "conv3_1/2/pre"
}
layer {
    name: "conv3_1/2/conv"
    type: "Convolution"
    bottom: "conv3_1/2/pre"
    top: "conv3_1/2"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 48
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_1/3/bn"
    type: "BatchNorm"
    bottom: "conv3_1/2"
    top: "conv3_1/3/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_1/3/neg"
    type: "Power"
    bottom: "conv3_1/3/pre"
    top: "conv3_1/3/neg"
    power_param {
        power: 1
        scale: -1.0
        shift: 0
    }
}
layer {
    name: "conv3_1/3/concat"
    type: "Concat"
    bottom: "conv3_1/3/pre"
    bottom: "conv3_1/3/neg"
    top: "conv3_1/3/preAct"
}
layer {
    name: "conv3_1/3/scale"
    type: "Scale"
    bottom: "conv3_1/3/preAct"
    top: "conv3_1/3/preAct"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_1/3/relu"
    type: "ReLU"
    bottom: "conv3_1/3/preAct"
    top: "conv3_1/3/preAct"
}
layer {
    name: "conv3_1/3/conv"
    type: "Convolution"
    bottom: "conv3_1/3/preAct"
    top: "conv3_1/3"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 128
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_1/proj"
    type: "Convolution"
    bottom: "conv3_1/1/pre"
    top: "conv3_1/proj"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 128
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 2
        stride_w: 2
    }
}
layer {
    name: "conv3_1"
    type: "Eltwise"
    bottom: "conv3_1/3"
    bottom: "conv3_1/proj"
    top: "conv3_1"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer {
    name: "conv3_2/1/bn"
    type: "BatchNorm"
    bottom: "conv3_1"
    top: "conv3_2/1/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_2/1/bn_scale"
    type: "Scale"
    bottom: "conv3_2/1/pre"
    top: "conv3_2/1/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_2/1/relu"
    type: "ReLU"
    bottom: "conv3_2/1/pre"
    top: "conv3_2/1/pre"
}
layer {
    name: "conv3_2/1/conv"
    type: "Convolution"
    bottom: "conv3_2/1/pre"
    top: "conv3_2/1"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 48
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_2/2/bn"
    type: "BatchNorm"
    bottom: "conv3_2/1"
    top: "conv3_2/2/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_2/2/bn_scale"
    type: "Scale"
    bottom: "conv3_2/2/pre"
    top: "conv3_2/2/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_2/2/relu"
    type: "ReLU"
    bottom: "conv3_2/2/pre"
    top: "conv3_2/2/pre"
}
layer {
    name: "conv3_2/2/conv"
    type: "Convolution"
    bottom: "conv3_2/2/pre"
    top: "conv3_2/2"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 48
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_2/3/bn"
    type: "BatchNorm"
    bottom: "conv3_2/2"
    top: "conv3_2/3/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_2/3/neg"
    type: "Power"
    bottom: "conv3_2/3/pre"
    top: "conv3_2/3/neg"
    power_param {
        power: 1
        scale: -1.0
        shift: 0
    }
}
layer {
    name: "conv3_2/3/concat"
    type: "Concat"
    bottom: "conv3_2/3/pre"
    bottom: "conv3_2/3/neg"
    top: "conv3_2/3/preAct"
}
layer {
    name: "conv3_2/3/scale"
    type: "Scale"
    bottom: "conv3_2/3/preAct"
    top: "conv3_2/3/preAct"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_2/3/relu"
    type: "ReLU"
    bottom: "conv3_2/3/preAct"
    top: "conv3_2/3/preAct"
}
layer {
    name: "conv3_2/3/conv"
    type: "Convolution"
    bottom: "conv3_2/3/preAct"
    top: "conv3_2/3"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 128
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_2/input"
    type: "Power"
    bottom: "conv3_1"
    top: "conv3_2/input"
    power_param {
        power: 1
        scale: 1
        shift: 0
    }
}
layer {
    name: "conv3_2"
    type: "Eltwise"
    bottom: "conv3_2/3"
    bottom: "conv3_2/input"
    top: "conv3_2"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer {
    name: "conv3_3/1/bn"
    type: "BatchNorm"
    bottom: "conv3_2"
    top: "conv3_3/1/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_3/1/bn_scale"
    type: "Scale"
    bottom: "conv3_3/1/pre"
    top: "conv3_3/1/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_3/1/relu"
    type: "ReLU"
    bottom: "conv3_3/1/pre"
    top: "conv3_3/1/pre"
}
layer {
    name: "conv3_3/1/conv"
    type: "Convolution"
    bottom: "conv3_3/1/pre"
    top: "conv3_3/1"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 48
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_3/2/bn"
    type: "BatchNorm"
    bottom: "conv3_3/1"
    top: "conv3_3/2/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_3/2/bn_scale"
    type: "Scale"
    bottom: "conv3_3/2/pre"
    top: "conv3_3/2/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_3/2/relu"
    type: "ReLU"
    bottom: "conv3_3/2/pre"
    top: "conv3_3/2/pre"
}
layer {
    name: "conv3_3/2/conv"
    type: "Convolution"
    bottom: "conv3_3/2/pre"
    top: "conv3_3/2"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 48
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_3/3/bn"
    type: "BatchNorm"
    bottom: "conv3_3/2"
    top: "conv3_3/3/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_3/3/neg"
    type: "Power"
    bottom: "conv3_3/3/pre"
    top: "conv3_3/3/neg"
    power_param {
        power: 1
        scale: -1.0
        shift: 0
    }
}
layer {
    name: "conv3_3/3/concat"
    type: "Concat"
    bottom: "conv3_3/3/pre"
    bottom: "conv3_3/3/neg"
    top: "conv3_3/3/preAct"
}
layer {
    name: "conv3_3/3/scale"
    type: "Scale"
    bottom: "conv3_3/3/preAct"
    top: "conv3_3/3/preAct"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_3/3/relu"
    type: "ReLU"
    bottom: "conv3_3/3/preAct"
    top: "conv3_3/3/preAct"
}
layer {
    name: "conv3_3/3/conv"
    type: "Convolution"
    bottom: "conv3_3/3/preAct"
    top: "conv3_3/3"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 128
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_3/input"
    type: "Power"
    bottom: "conv3_2"
    top: "conv3_3/input"
    power_param {
        power: 1
        scale: 1
        shift: 0
    }
}
layer {
    name: "conv3_3"
    type: "Eltwise"
    bottom: "conv3_3/3"
    bottom: "conv3_3/input"
    top: "conv3_3"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer {
    name: "conv3_4/1/bn"
    type: "BatchNorm"
    bottom: "conv3_3"
    top: "conv3_4/1/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_4/1/bn_scale"
    type: "Scale"
    bottom: "conv3_4/1/pre"
    top: "conv3_4/1/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_4/1/relu"
    type: "ReLU"
    bottom: "conv3_4/1/pre"
    top: "conv3_4/1/pre"
}
layer {
    name: "conv3_4/1/conv"
    type: "Convolution"
    bottom: "conv3_4/1/pre"
    top: "conv3_4/1"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 48
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_4/2/bn"
    type: "BatchNorm"
    bottom: "conv3_4/1"
    top: "conv3_4/2/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_4/2/bn_scale"
    type: "Scale"
    bottom: "conv3_4/2/pre"
    top: "conv3_4/2/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_4/2/relu"
    type: "ReLU"
    bottom: "conv3_4/2/pre"
    top: "conv3_4/2/pre"
}
layer {
    name: "conv3_4/2/conv"
    type: "Convolution"
    bottom: "conv3_4/2/pre"
    top: "conv3_4/2"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 48
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_4/3/bn"
    type: "BatchNorm"
    bottom: "conv3_4/2"
    top: "conv3_4/3/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv3_4/3/neg"
    type: "Power"
    bottom: "conv3_4/3/pre"
    top: "conv3_4/3/neg"
    power_param {
        power: 1
        scale: -1.0
        shift: 0
    }
}
layer {
    name: "conv3_4/3/concat"
    type: "Concat"
    bottom: "conv3_4/3/pre"
    bottom: "conv3_4/3/neg"
    top: "conv3_4/3/preAct"
}
layer {
    name: "conv3_4/3/scale"
    type: "Scale"
    bottom: "conv3_4/3/preAct"
    top: "conv3_4/3/preAct"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv3_4/3/relu"
    type: "ReLU"
    bottom: "conv3_4/3/preAct"
    top: "conv3_4/3/preAct"
}
layer {
    name: "conv3_4/3/conv"
    type: "Convolution"
    bottom: "conv3_4/3/preAct"
    top: "conv3_4/3"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 128
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv3_4/input"
    type: "Power"
    bottom: "conv3_3"
    top: "conv3_4/input"
    power_param {
        power: 1
        scale: 1
        shift: 0
    }
}
layer {
    name: "conv3_4"
    type: "Eltwise"
    bottom: "conv3_4/3"
    bottom: "conv3_4/input"
    top: "conv3_4"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer {
    name: "conv4_1/incep/bn"
    type: "BatchNorm"
    bottom: "conv3_4"
    top: "conv4_1/incep/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_1/incep/bn_scale"
    type: "Scale"
    bottom: "conv4_1/incep/pre"
    top: "conv4_1/incep/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_1/incep/relu"
    type: "ReLU"
    bottom: "conv4_1/incep/pre"
    top: "conv4_1/incep/pre"
}
layer {
    name: "conv4_1/incep/0/conv"
    type: "Convolution"
    bottom: "conv4_1/incep/pre"
    top: "conv4_1/incep/0"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 64
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 2
        stride_w: 2
    }
}
layer {
    name: "conv4_1/incep/0/bn"
    type: "BatchNorm"
    bottom: "conv4_1/incep/0"
    top: "conv4_1/incep/0"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_1/incep/0/bn_scale"
    type: "Scale"
    bottom: "conv4_1/incep/0"
    top: "conv4_1/incep/0"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_1/incep/0/relu"
    type: "ReLU"
    bottom: "conv4_1/incep/0"
    top: "conv4_1/incep/0"
}
layer {
    name: "conv4_1/incep/1_reduce/conv"
    type: "Convolution"
    bottom: "conv4_1/incep/pre"
    top: "conv4_1/incep/1_reduce"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 48
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 2
        stride_w: 2
    }
}
layer {
    name: "conv4_1/incep/1_reduce/bn"
    type: "BatchNorm"
    bottom: "conv4_1/incep/1_reduce"
    top: "conv4_1/incep/1_reduce"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_1/incep/1_reduce/bn_scale"
    type: "Scale"
    bottom: "conv4_1/incep/1_reduce"
    top: "conv4_1/incep/1_reduce"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_1/incep/1_reduce/relu"
    type: "ReLU"
    bottom: "conv4_1/incep/1_reduce"
    top: "conv4_1/incep/1_reduce"
}
layer {
    name: "conv4_1/incep/1_0/conv"
    type: "Convolution"
    bottom: "conv4_1/incep/1_reduce"
    top: "conv4_1/incep/1_0"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 128
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv4_1/incep/1_0/bn"
    type: "BatchNorm"
    bottom: "conv4_1/incep/1_0"
    top: "conv4_1/incep/1_0"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_1/incep/1_0/bn_scale"
    type: "Scale"
    bottom: "conv4_1/incep/1_0"
    top: "conv4_1/incep/1_0"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_1/incep/1_0/relu"
    type: "ReLU"
    bottom: "conv4_1/incep/1_0"
    top: "conv4_1/incep/1_0"
}
layer {
    name: "conv4_1/incep/2_reduce/conv"
    type: "Convolution"
    bottom: "conv4_1/incep/pre"
    top: "conv4_1/incep/2_reduce"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 24
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 2
        stride_w: 2
    }
}
layer {
    name: "conv4_1/incep/2_reduce/bn"
    type: "BatchNorm"
    bottom: "conv4_1/incep/2_reduce"
    top: "conv4_1/incep/2_reduce"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_1/incep/2_reduce/bn_scale"
    type: "Scale"
    bottom: "conv4_1/incep/2_reduce"
    top: "conv4_1/incep/2_reduce"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_1/incep/2_reduce/relu"
    type: "ReLU"
    bottom: "conv4_1/incep/2_reduce"
    top: "conv4_1/incep/2_reduce"
}
layer {
    name: "conv4_1/incep/2_0/conv"
    type: "Convolution"
    bottom: "conv4_1/incep/2_reduce"
    top: "conv4_1/incep/2_0"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 48
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv4_1/incep/2_0/bn"
    type: "BatchNorm"
    bottom: "conv4_1/incep/2_0"
    top: "conv4_1/incep/2_0"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_1/incep/2_0/bn_scale"
    type: "Scale"
    bottom: "conv4_1/incep/2_0"
    top: "conv4_1/incep/2_0"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_1/incep/2_0/relu"
    type: "ReLU"
    bottom: "conv4_1/incep/2_0"
    top: "conv4_1/incep/2_0"
}
layer {
    name: "conv4_1/incep/2_1/conv"
    type: "Convolution"
    bottom: "conv4_1/incep/2_0"
    top: "conv4_1/incep/2_1"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 48
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv4_1/incep/2_1/bn"
    type: "BatchNorm"
    bottom: "conv4_1/incep/2_1"
    top: "conv4_1/incep/2_1"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_1/incep/2_1/bn_scale"
    type: "Scale"
    bottom: "conv4_1/incep/2_1"
    top: "conv4_1/incep/2_1"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_1/incep/2_1/relu"
    type: "ReLU"
    bottom: "conv4_1/incep/2_1"
    top: "conv4_1/incep/2_1"
}
layer {
    name: "conv4_1/incep/pool"
    type: "Pooling"
    bottom: "conv4_1/incep/pre"
    top: "conv4_1/incep/pool"
    pooling_param {
        pool: MAX
        kernel_size: 3
        stride: 2
        pad: 0
    }
}
layer {
    name: "conv4_1/incep/poolproj/conv"
    type: "Convolution"
    bottom: "conv4_1/incep/pool"
    top: "conv4_1/incep/poolproj"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 128
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv4_1/incep/poolproj/bn"
    type: "BatchNorm"
    bottom: "conv4_1/incep/poolproj"
    top: "conv4_1/incep/poolproj"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_1/incep/poolproj/bn_scale"
    type: "Scale"
    bottom: "conv4_1/incep/poolproj"
    top: "conv4_1/incep/poolproj"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_1/incep/poolproj/relu"
    type: "ReLU"
    bottom: "conv4_1/incep/poolproj"
    top: "conv4_1/incep/poolproj"
}
layer {
    name: "conv4_1/incep"
    type: "Concat"
    bottom: "conv4_1/incep/0"
    bottom: "conv4_1/incep/1_0"
    bottom: "conv4_1/incep/2_1"
    bottom: "conv4_1/incep/poolproj"
    top: "conv4_1/incep"
}
layer {
    name: "conv4_1/out/conv"
    type: "Convolution"
    bottom: "conv4_1/incep"
    top: "conv4_1/out"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 256
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv4_1/proj"
    type: "Convolution"
    bottom: "conv3_4"
    top: "conv4_1/proj"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    param {
        lr_mult: 2.0
        decay_mult: 0.0
    }
    convolution_param {
        num_output: 256
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
            value: 0.1
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 2
        stride_w: 2
    }
}
layer {
    name: "conv4_1"
    type: "Eltwise"
    bottom: "conv4_1/out"
    bottom: "conv4_1/proj"
    top: "conv4_1"
    eltwise_param {
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer {
    name: "conv4_2/incep/bn"
    type: "BatchNorm"
    bottom: "conv4_1"
    top: "conv4_2/incep/pre"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_2/incep/bn_scale"
    type: "Scale"
    bottom: "conv4_2/incep/pre"
    top: "conv4_2/incep/pre"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_2/incep/relu"
    type: "ReLU"
    bottom: "conv4_2/incep/pre"
    top: "conv4_2/incep/pre"
}
layer {
    name: "conv4_2/incep/0/conv"
    type: "Convolution"
    bottom: "conv4_2/incep/pre"
    top: "conv4_2/incep/0"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 64
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv4_2/incep/0/bn"
    type: "BatchNorm"
    bottom: "conv4_2/incep/0"
    top: "conv4_2/incep/0"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_2/incep/0/bn_scale"
    type: "Scale"
    bottom: "conv4_2/incep/0"
    top: "conv4_2/incep/0"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_2/incep/0/relu"
    type: "ReLU"
    bottom: "conv4_2/incep/0"
    top: "conv4_2/incep/0"
}
layer {
    name: "conv4_2/incep/1_reduce/conv"
    type: "Convolution"
    bottom: "conv4_2/incep/pre"
    top: "conv4_2/incep/1_reduce"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 64
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv4_2/incep/1_reduce/bn"
    type: "BatchNorm"
    bottom: "conv4_2/incep/1_reduce"
    top: "conv4_2/incep/1_reduce"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_2/incep/1_reduce/bn_scale"
    type: "Scale"
    bottom: "conv4_2/incep/1_reduce"
    top: "conv4_2/incep/1_reduce"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_2/incep/1_reduce/relu"
    type: "ReLU"
    bottom: "conv4_2/incep/1_reduce"
    top: "conv4_2/incep/1_reduce"
}
layer {
    name: "conv4_2/incep/1_0/conv"
    type: "Convolution"
    bottom: "conv4_2/incep/1_reduce"
    top: "conv4_2/incep/1_0"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 128
        bias_term: false
        weight_filler {
            type: "xavier"
        }
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride_h: 1
        stride_w: 1
    }
}
layer {
    name: "conv4_2/incep/1_0/bn"
    type: "BatchNorm"
    bottom: "conv4_2/incep/1_0"
    top: "conv4_2/incep/1_0"
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    param {
        lr_mult: 0
        decay_mult: 0
    }
    batch_norm_param {
        use_global_stats: true
    }
}
layer {
    name: "conv4_2/incep/1_0/bn_scale"
    type: "Scale"
    bottom: "conv4_2/incep/1_0"
    top: "conv4_2/incep/1_0"
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    param {
        lr_mult: 1.0
        decay_mult: 0
    }
    scale_param {
        bias_term: true
    }
}
layer {
    name: "conv4_2/incep/1_0/relu"
    type: "ReLU"
    bottom: "conv4_2/incep/1_0"
    top: "conv4_2/incep/1_0"
}
layer {
    name: "conv4_2/incep/2_reduce/conv"
    type: "Convolution"
    bottom: "conv4_2/incep/pre"
    top: "conv4_2/incep/2_reduce"
    param {
        lr_mult: 1.0
        decay_mult: 1.0
    }
    convolution_param {
        num_output: 24
        bias_term: false
        weight_filler {
