name: "FPN_lite"

################################################################################
## Input
################################################################################

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 640
  dim: 1024
}

input: "im_info"
input_shape {
  dim: 1
  dim: 6
}
##################################################################
# convolution
##################################################################

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32
    kernel_size: 4  stride: 2  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "conv1/bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "conv1/scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

################################################################################
## Conv 2
################################################################################
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 48
    kernel_size: 3  stride: 2  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "conv2/bn"
  type: "BatchNorm"
  bottom: "conv2"
  top: "conv2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "conv2/scale"
  type: "Scale"
  bottom: "conv2"
  top: "conv2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

################################################################################
## Conv 3
################################################################################
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96
    kernel_size: 3  stride: 2  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "conv3/bn"
  type: "BatchNorm"
  bottom: "conv3"
  top: "conv3"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "conv3/scale"
  type: "Scale"
  bottom: "conv3"
  top: "conv3"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

################################################################################
## Inception 3a
################################################################################
layer {
  name: "inc3a/pool1"
  type: "Pooling"
  bottom: "conv3"
  top: "inc3a/pool1"
  pooling_param {
    kernel_size: 3  stride: 2  pad: 0
    pool: MAX
  }
}
layer {
  name: "inc3a/conv1"
  type: "Convolution"
  bottom: "inc3a/pool1"
  top: "inc3a/conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3a/conv1/bn"
  type: "BatchNorm"
  bottom: "inc3a/conv1"
  top: "inc3a/conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3a/conv1/scale"
  type: "Scale"
  bottom: "inc3a/conv1"
  top: "inc3a/conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3a/relu1"
  type: "ReLU"
  bottom: "inc3a/conv1"
  top: "inc3a/conv1"
}
layer {
  name: "inc3a/conv3_1"
  type: "Convolution"
  bottom: "conv3"
  top: "inc3a/conv3_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3a/conv3_1/bn"
  type: "BatchNorm"
  bottom: "inc3a/conv3_1"
  top: "inc3a/conv3_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3a/conv3_1/scale"
  type: "Scale"
  bottom: "inc3a/conv3_1"
  top: "inc3a/conv3_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3a/relu3_1"
  type: "ReLU"
  bottom: "inc3a/conv3_1"
  top: "inc3a/conv3_1"
}
layer {
  name: "inc3a/conv3_2"
  type: "Convolution"
  bottom: "inc3a/conv3_1"
  top: "inc3a/conv3_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 64  kernel_size: 3  stride: 2  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3a/conv3_2/bn"
  type: "BatchNorm"
  bottom: "inc3a/conv3_2"
  top: "inc3a/conv3_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3a/conv3_2/scale"
  type: "Scale"
  bottom: "inc3a/conv3_2"
  top: "inc3a/conv3_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3a/relu3_2"
  type: "ReLU"
  bottom: "inc3a/conv3_2"
  top: "inc3a/conv3_2"
}
layer {
  name: "inc3a/conv5_1"
  type: "Convolution"
  bottom: "conv3"
  top: "inc3a/conv5_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3a/conv5_1/bn"
  type: "BatchNorm"
  bottom: "inc3a/conv5_1"
  top: "inc3a/conv5_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3a/conv5_1/scale"
  type: "Scale"
  bottom: "inc3a/conv5_1"
  top: "inc3a/conv5_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3a/relu5_1"
  type: "ReLU"
  bottom: "inc3a/conv5_1"
  top: "inc3a/conv5_1"
}
layer {
  name: "inc3a/conv5_2"
  type: "Convolution"
  bottom: "inc3a/conv5_1"
  top: "inc3a/conv5_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3a/conv5_2/bn"
  type: "BatchNorm"
  bottom: "inc3a/conv5_2"
  top: "inc3a/conv5_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3a/conv5_2/scale"
  type: "Scale"
  bottom: "inc3a/conv5_2"
  top: "inc3a/conv5_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3a/relu5_2"
  type: "ReLU"
  bottom: "inc3a/conv5_2"
  top: "inc3a/conv5_2"
}
layer {
  name: "inc3a/conv5_3"
  type: "Convolution"
  bottom: "inc3a/conv5_2"
  top: "inc3a/conv5_3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  stride: 2  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3a/conv5_3/bn"
  type: "BatchNorm"
  bottom: "inc3a/conv5_3"
  top: "inc3a/conv5_3"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3a/conv5_3/scale"
  type: "Scale"
  bottom: "inc3a/conv5_3"
  top: "inc3a/conv5_3"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3a/relu5_3"
  type: "ReLU"
  bottom: "inc3a/conv5_3"
  top: "inc3a/conv5_3"
}
layer {
  name: "inc3a"
  type: "Concat"
  bottom: "inc3a/conv1"
  bottom: "inc3a/conv3_2"
  bottom: "inc3a/conv5_3"
  top: "inc3a"
}

################################################################################
## Inception 3b
################################################################################
layer {
  name: "inc3b/conv1"
  type: "Convolution"
  bottom: "inc3a"
  top: "inc3b/conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3b/conv1/bn"
  type: "BatchNorm"
  bottom: "inc3b/conv1"
  top: "inc3b/conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3b/conv1/scale"
  type: "Scale"
  bottom: "inc3b/conv1"
  top: "inc3b/conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3b/relu1"
  type: "ReLU"
  bottom: "inc3b/conv1"
  top: "inc3b/conv1"
}
layer {
  name: "inc3b/conv3_1"
  type: "Convolution"
  bottom: "inc3a"
  top: "inc3b/conv3_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3b/conv3_1/bn"
  type: "BatchNorm"
  bottom: "inc3b/conv3_1"
  top: "inc3b/conv3_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3b/conv3_1/scale"
  type: "Scale"
  bottom: "inc3b/conv3_1"
  top: "inc3b/conv3_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3b/relu3_1"
  type: "ReLU"
  bottom: "inc3b/conv3_1"
  top: "inc3b/conv3_1"
}
layer {
  name: "inc3b/conv3_2"
  type: "Convolution"
  bottom: "inc3b/conv3_1"
  top: "inc3b/conv3_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 64  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3b/conv3_2/bn"
  type: "BatchNorm"
  bottom: "inc3b/conv3_2"
  top: "inc3b/conv3_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3b/conv3_2/scale"
  type: "Scale"
  bottom: "inc3b/conv3_2"
  top: "inc3b/conv3_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3b/relu3_2"
  type: "ReLU"
  bottom: "inc3b/conv3_2"
  top: "inc3b/conv3_2"
}
layer {
  name: "inc3b/conv5_1"
  type: "Convolution"
  bottom: "inc3a"
  top: "inc3b/conv5_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3b/conv5_1/bn"
  type: "BatchNorm"
  bottom: "inc3b/conv5_1"
  top: "inc3b/conv5_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3b/conv5_1/scale"
  type: "Scale"
  bottom: "inc3b/conv5_1"
  top: "inc3b/conv5_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3b/relu5_1"
  type: "ReLU"
  bottom: "inc3b/conv5_1"
  top: "inc3b/conv5_1"
}
layer {
  name: "inc3b/conv5_2"
  type: "Convolution"
  bottom: "inc3b/conv5_1"
  top: "inc3b/conv5_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3b/conv5_2/bn"
  type: "BatchNorm"
  bottom: "inc3b/conv5_2"
  top: "inc3b/conv5_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3b/conv5_2/scale"
  type: "Scale"
  bottom: "inc3b/conv5_2"
  top: "inc3b/conv5_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3b/relu5_2"
  type: "ReLU"
  bottom: "inc3b/conv5_2"
  top: "inc3b/conv5_2"
}
layer {
  name: "inc3b/conv5_3"
  type: "Convolution"
  bottom: "inc3b/conv5_2"
  top: "inc3b/conv5_3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3b/conv5_3/bn"
  type: "BatchNorm"
  bottom: "inc3b/conv5_3"
  top: "inc3b/conv5_3"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3b/conv5_3/scale"
  type: "Scale"
  bottom: "inc3b/conv5_3"
  top: "inc3b/conv5_3"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3b/relu5_3"
  type: "ReLU"
  bottom: "inc3b/conv5_3"
  top: "inc3b/conv5_3"
}
layer {
  name: "inc3b"
  type: "Concat"
  bottom: "inc3b/conv1"
  bottom: "inc3b/conv3_2"
  bottom: "inc3b/conv5_3"
  top: "inc3b"
}

################################################################################
## Inception 3c
################################################################################
layer {
  name: "inc3c/conv1"
  type: "Convolution"
  bottom: "inc3b"
  top: "inc3c/conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3c/conv1/bn"
  type: "BatchNorm"
  bottom: "inc3c/conv1"
  top: "inc3c/conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3c/conv1/scale"
  type: "Scale"
  bottom: "inc3c/conv1"
  top: "inc3c/conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3c/relu1"
  type: "ReLU"
  bottom: "inc3c/conv1"
  top: "inc3c/conv1"
}
layer {
  name: "inc3c/conv3_1"
  type: "Convolution"
  bottom: "inc3b"
  top: "inc3c/conv3_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3c/conv3_1/bn"
  type: "BatchNorm"
  bottom: "inc3c/conv3_1"
  top: "inc3c/conv3_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3c/conv3_1/scale"
  type: "Scale"
  bottom: "inc3c/conv3_1"
  top: "inc3c/conv3_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3c/relu3_1"
  type: "ReLU"
  bottom: "inc3c/conv3_1"
  top: "inc3c/conv3_1"
}
layer {
  name: "inc3c/conv3_2"
  type: "Convolution"
  bottom: "inc3c/conv3_1"
  top: "inc3c/conv3_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 64  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3c/conv3_2/bn"
  type: "BatchNorm"
  bottom: "inc3c/conv3_2"
  top: "inc3c/conv3_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3c/conv3_2/scale"
  type: "Scale"
  bottom: "inc3c/conv3_2"
  top: "inc3c/conv3_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3c/relu3_2"
  type: "ReLU"
  bottom: "inc3c/conv3_2"
  top: "inc3c/conv3_2"
}
layer {
  name: "inc3c/conv5_1"
  type: "Convolution"
  bottom: "inc3b"
  top: "inc3c/conv5_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3c/conv5_1/bn"
  type: "BatchNorm"
  bottom: "inc3c/conv5_1"
  top: "inc3c/conv5_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3c/conv5_1/scale"
  type: "Scale"
  bottom: "inc3c/conv5_1"
  top: "inc3c/conv5_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3c/relu5_1"
  type: "ReLU"
  bottom: "inc3c/conv5_1"
  top: "inc3c/conv5_1"
}
layer {
  name: "inc3c/conv5_2"
  type: "Convolution"
  bottom: "inc3c/conv5_1"
  top: "inc3c/conv5_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3c/conv5_2/bn"
  type: "BatchNorm"
  bottom: "inc3c/conv5_2"
  top: "inc3c/conv5_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3c/conv5_2/scale"
  type: "Scale"
  bottom: "inc3c/conv5_2"
  top: "inc3c/conv5_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3c/relu5_2"
  type: "ReLU"
  bottom: "inc3c/conv5_2"
  top: "inc3c/conv5_2"
}
layer {
  name: "inc3c/conv5_3"
  type: "Convolution"
  bottom: "inc3c/conv5_2"
  top: "inc3c/conv5_3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3c/conv5_3/bn"
  type: "BatchNorm"
  bottom: "inc3c/conv5_3"
  top: "inc3c/conv5_3"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3c/conv5_3/scale"
  type: "Scale"
  bottom: "inc3c/conv5_3"
  top: "inc3c/conv5_3"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3c/relu5_3"
  type: "ReLU"
  bottom: "inc3c/conv5_3"
  top: "inc3c/conv5_3"
}
layer {
  name: "inc3c"
  type: "Concat"
  bottom: "inc3c/conv1"
  bottom: "inc3c/conv3_2"
  bottom: "inc3c/conv5_3"
  top: "inc3c"
}

################################################################################
## Inception 3d
################################################################################
layer {
  name: "inc3d/conv1"
  type: "Convolution"
  bottom: "inc3c"
  top: "inc3d/conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3d/conv1/bn"
  type: "BatchNorm"
  bottom: "inc3d/conv1"
  top: "inc3d/conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3d/conv1/scale"
  type: "Scale"
  bottom: "inc3d/conv1"
  top: "inc3d/conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3d/relu1"
  type: "ReLU"
  bottom: "inc3d/conv1"
  top: "inc3d/conv1"
}
layer {
  name: "inc3d/conv3_1"
  type: "Convolution"
  bottom: "inc3c"
  top: "inc3d/conv3_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3d/conv3_1/bn"
  type: "BatchNorm"
  bottom: "inc3d/conv3_1"
  top: "inc3d/conv3_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3d/conv3_1/scale"
  type: "Scale"
  bottom: "inc3d/conv3_1"
  top: "inc3d/conv3_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3d/relu3_1"
  type: "ReLU"
  bottom: "inc3d/conv3_1"
  top: "inc3d/conv3_1"
}
layer {
  name: "inc3d/conv3_2"
  type: "Convolution"
  bottom: "inc3d/conv3_1"
  top: "inc3d/conv3_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 64  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3d/conv3_2/bn"
  type: "BatchNorm"
  bottom: "inc3d/conv3_2"
  top: "inc3d/conv3_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3d/conv3_2/scale"
  type: "Scale"
  bottom: "inc3d/conv3_2"
  top: "inc3d/conv3_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3d/relu3_2"
  type: "ReLU"
  bottom: "inc3d/conv3_2"
  top: "inc3d/conv3_2"
}
layer {
  name: "inc3d/conv5_1"
  type: "Convolution"
  bottom: "inc3c"
  top: "inc3d/conv5_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3d/conv5_1/bn"
  type: "BatchNorm"
  bottom: "inc3d/conv5_1"
  top: "inc3d/conv5_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3d/conv5_1/scale"
  type: "Scale"
  bottom: "inc3d/conv5_1"
  top: "inc3d/conv5_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3d/relu5_1"
  type: "ReLU"
  bottom: "inc3d/conv5_1"
  top: "inc3d/conv5_1"
}
layer {
  name: "inc3d/conv5_2"
  type: "Convolution"
  bottom: "inc3d/conv5_1"
  top: "inc3d/conv5_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3d/conv5_2/bn"
  type: "BatchNorm"
  bottom: "inc3d/conv5_2"
  top: "inc3d/conv5_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3d/conv5_2/scale"
  type: "Scale"
  bottom: "inc3d/conv5_2"
  top: "inc3d/conv5_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3d/relu5_2"
  type: "ReLU"
  bottom: "inc3d/conv5_2"
  top: "inc3d/conv5_2"
}
layer {
  name: "inc3d/conv5_3"
  type: "Convolution"
  bottom: "inc3d/conv5_2"
  top: "inc3d/conv5_3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3d/conv5_3/bn"
  type: "BatchNorm"
  bottom: "inc3d/conv5_3"
  top: "inc3d/conv5_3"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3d/conv5_3/scale"
  type: "Scale"
  bottom: "inc3d/conv5_3"
  top: "inc3d/conv5_3"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3d/relu5_3"
  type: "ReLU"
  bottom: "inc3d/conv5_3"
  top: "inc3d/conv5_3"
}
layer {
  name: "inc3d"
  type: "Concat"
  bottom: "inc3d/conv1"
  bottom: "inc3d/conv3_2"
  bottom: "inc3d/conv5_3"
  top: "inc3d"
}

################################################################################
## Inception 3e
################################################################################
layer {
  name: "inc3e/conv1"
  type: "Convolution"
  bottom: "inc3d"
  top: "inc3e/conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3e/conv1/bn"
  type: "BatchNorm"
  bottom: "inc3e/conv1"
  top: "inc3e/conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3e/conv1/scale"
  type: "Scale"
  bottom: "inc3e/conv1"
  top: "inc3e/conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3e/relu1"
  type: "ReLU"
  bottom: "inc3e/conv1"
  top: "inc3e/conv1"
}
layer {
  name: "inc3e/conv3_1"
  type: "Convolution"
  bottom: "inc3d"
  top: "inc3e/conv3_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3e/conv3_1/bn"
  type: "BatchNorm"
  bottom: "inc3e/conv3_1"
  top: "inc3e/conv3_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3e/conv3_1/scale"
  type: "Scale"
  bottom: "inc3e/conv3_1"
  top: "inc3e/conv3_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3e/relu3_1"
  type: "ReLU"
  bottom: "inc3e/conv3_1"
  top: "inc3e/conv3_1"
}
layer {
  name: "inc3e/conv3_2"
  type: "Convolution"
  bottom: "inc3e/conv3_1"
  top: "inc3e/conv3_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 64  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3e/conv3_2/bn"
  type: "BatchNorm"
  bottom: "inc3e/conv3_2"
  top: "inc3e/conv3_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3e/conv3_2/scale"
  type: "Scale"
  bottom: "inc3e/conv3_2"
  top: "inc3e/conv3_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3e/relu3_2"
  type: "ReLU"
  bottom: "inc3e/conv3_2"
  top: "inc3e/conv3_2"
}
layer {
  name: "inc3e/conv5_1"
  type: "Convolution"
  bottom: "inc3d"
  top: "inc3e/conv5_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3e/conv5_1/bn"
  type: "BatchNorm"
  bottom: "inc3e/conv5_1"
  top: "inc3e/conv5_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3e/conv5_1/scale"
  type: "Scale"
  bottom: "inc3e/conv5_1"
  top: "inc3e/conv5_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3e/relu5_1"
  type: "ReLU"
  bottom: "inc3e/conv5_1"
  top: "inc3e/conv5_1"
}
layer {
  name: "inc3e/conv5_2"
  type: "Convolution"
  bottom: "inc3e/conv5_1"
  top: "inc3e/conv5_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3e/conv5_2/bn"
  type: "BatchNorm"
  bottom: "inc3e/conv5_2"
  top: "inc3e/conv5_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3e/conv5_2/scale"
  type: "Scale"
  bottom: "inc3e/conv5_2"
  top: "inc3e/conv5_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3e/relu5_2"
  type: "ReLU"
  bottom: "inc3e/conv5_2"
  top: "inc3e/conv5_2"
}
layer {
  name: "inc3e/conv5_3"
  type: "Convolution"
  bottom: "inc3e/conv5_2"
  top: "inc3e/conv5_3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc3e/conv5_3/bn"
  type: "BatchNorm"
  bottom: "inc3e/conv5_3"
  top: "inc3e/conv5_3"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc3e/conv5_3/scale"
  type: "Scale"
  bottom: "inc3e/conv5_3"
  top: "inc3e/conv5_3"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc3e/relu5_3"
  type: "ReLU"
  bottom: "inc3e/conv5_3"
  top: "inc3e/conv5_3"
}
layer {
  name: "inc3e"
  type: "Concat"
  bottom: "inc3e/conv1"
  bottom: "inc3e/conv3_2"
  bottom: "inc3e/conv5_3"
  top: "inc3e"
}

################################################################################
## Inception 4a
################################################################################
layer {
  name: "inc4a/pool1"
  type: "Pooling"
  bottom: "inc3e"
  top: "inc4a/pool1"
  pooling_param {
    kernel_size: 3  stride: 2  pad: 0
    pool: MAX
  }
}
layer {
  name: "inc4a/conv1"
  type: "Convolution"
  bottom: "inc4a/pool1"
  top: "inc4a/conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 128  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4a/conv1/bn"
  type: "BatchNorm"
  bottom: "inc4a/conv1"
  top: "inc4a/conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4a/conv1/scale"
  type: "Scale"
  bottom: "inc4a/conv1"
  top: "inc4a/conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4a/relu1"
  type: "ReLU"
  bottom: "inc4a/conv1"
  top: "inc4a/conv1"
}
layer {
  name: "inc4a/conv3_1"
  type: "Convolution"
  bottom: "inc3e"
  top: "inc4a/conv3_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4a/conv3_1/bn"
  type: "BatchNorm"
  bottom: "inc4a/conv3_1"
  top: "inc4a/conv3_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4a/conv3_1/scale"
  type: "Scale"
  bottom: "inc4a/conv3_1"
  top: "inc4a/conv3_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4a/relu3_1"
  type: "ReLU"
  bottom: "inc4a/conv3_1"
  top: "inc4a/conv3_1"
}
layer {
  name: "inc4a/conv3_2"
  type: "Convolution"
  bottom: "inc4a/conv3_1"
  top: "inc4a/conv3_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96  kernel_size: 3  stride: 2  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4a/conv3_2/bn"
  type: "BatchNorm"
  bottom: "inc4a/conv3_2"
  top: "inc4a/conv3_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4a/conv3_2/scale"
  type: "Scale"
  bottom: "inc4a/conv3_2"
  top: "inc4a/conv3_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4a/relu3_2"
  type: "ReLU"
  bottom: "inc4a/conv3_2"
  top: "inc4a/conv3_2"
}
layer {
  name: "inc4a/conv5_1"
  type: "Convolution"
  bottom: "inc3e"
  top: "inc4a/conv5_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4a/conv5_1/bn"
  type: "BatchNorm"
  bottom: "inc4a/conv5_1"
  top: "inc4a/conv5_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4a/conv5_1/scale"
  type: "Scale"
  bottom: "inc4a/conv5_1"
  top: "inc4a/conv5_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4a/relu5_1"
  type: "ReLU"
  bottom: "inc4a/conv5_1"
  top: "inc4a/conv5_1"
}
layer {
  name: "inc4a/conv5_2"
  type: "Convolution"
  bottom: "inc4a/conv5_1"
  top: "inc4a/conv5_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4a/conv5_2/bn"
  type: "BatchNorm"
  bottom: "inc4a/conv5_2"
  top: "inc4a/conv5_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4a/conv5_2/scale"
  type: "Scale"
  bottom: "inc4a/conv5_2"
  top: "inc4a/conv5_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4a/relu5_2"
  type: "ReLU"
  bottom: "inc4a/conv5_2"
  top: "inc4a/conv5_2"
}
layer {
  name: "inc4a/conv5_3"
  type: "Convolution"
  bottom: "inc4a/conv5_2"
  top: "inc4a/conv5_3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  stride: 2  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4a/conv5_3/bn"
  type: "BatchNorm"
  bottom: "inc4a/conv5_3"
  top: "inc4a/conv5_3"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4a/conv5_3/scale"
  type: "Scale"
  bottom: "inc4a/conv5_3"
  top: "inc4a/conv5_3"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4a/relu5_3"
  type: "ReLU"
  bottom: "inc4a/conv5_3"
  top: "inc4a/conv5_3"
}
layer {
  name: "inc4a"
  type: "Concat"
  bottom: "inc4a/conv1"
  bottom: "inc4a/conv3_2"
  bottom: "inc4a/conv5_3"
  top: "inc4a"
}

################################################################################
## Inception 4b
################################################################################
layer {
  name: "inc4b/conv1"
  type: "Convolution"
  bottom: "inc4a"
  top: "inc4b/conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 128  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4b/conv1/bn"
  type: "BatchNorm"
  bottom: "inc4b/conv1"
  top: "inc4b/conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4b/conv1/scale"
  type: "Scale"
  bottom: "inc4b/conv1"
  top: "inc4b/conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4b/relu1"
  type: "ReLU"
  bottom: "inc4b/conv1"
  top: "inc4b/conv1"
}
layer {
  name: "inc4b/conv3_1"
  type: "Convolution"
  bottom: "inc4a"
  top: "inc4b/conv3_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4b/conv3_1/bn"
  type: "BatchNorm"
  bottom: "inc4b/conv3_1"
  top: "inc4b/conv3_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4b/conv3_1/scale"
  type: "Scale"
  bottom: "inc4b/conv3_1"
  top: "inc4b/conv3_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4b/relu3_1"
  type: "ReLU"
  bottom: "inc4b/conv3_1"
  top: "inc4b/conv3_1"
}
layer {
  name: "inc4b/conv3_2"
  type: "Convolution"
  bottom: "inc4b/conv3_1"
  top: "inc4b/conv3_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4b/conv3_2/bn"
  type: "BatchNorm"
  bottom: "inc4b/conv3_2"
  top: "inc4b/conv3_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4b/conv3_2/scale"
  type: "Scale"
  bottom: "inc4b/conv3_2"
  top: "inc4b/conv3_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4b/relu3_2"
  type: "ReLU"
  bottom: "inc4b/conv3_2"
  top: "inc4b/conv3_2"
}
layer {
  name: "inc4b/conv5_1"
  type: "Convolution"
  bottom: "inc4a"
  top: "inc4b/conv5_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4b/conv5_1/bn"
  type: "BatchNorm"
  bottom: "inc4b/conv5_1"
  top: "inc4b/conv5_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4b/conv5_1/scale"
  type: "Scale"
  bottom: "inc4b/conv5_1"
  top: "inc4b/conv5_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4b/relu5_1"
  type: "ReLU"
  bottom: "inc4b/conv5_1"
  top: "inc4b/conv5_1"
}
layer {
  name: "inc4b/conv5_2"
  type: "Convolution"
  bottom: "inc4b/conv5_1"
  top: "inc4b/conv5_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4b/conv5_2/bn"
  type: "BatchNorm"
  bottom: "inc4b/conv5_2"
  top: "inc4b/conv5_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4b/conv5_2/scale"
  type: "Scale"
  bottom: "inc4b/conv5_2"
  top: "inc4b/conv5_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4b/relu5_2"
  type: "ReLU"
  bottom: "inc4b/conv5_2"
  top: "inc4b/conv5_2"
}
layer {
  name: "inc4b/conv5_3"
  type: "Convolution"
  bottom: "inc4b/conv5_2"
  top: "inc4b/conv5_3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4b/conv5_3/bn"
  type: "BatchNorm"
  bottom: "inc4b/conv5_3"
  top: "inc4b/conv5_3"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4b/conv5_3/scale"
  type: "Scale"
  bottom: "inc4b/conv5_3"
  top: "inc4b/conv5_3"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4b/relu5_3"
  type: "ReLU"
  bottom: "inc4b/conv5_3"
  top: "inc4b/conv5_3"
}
layer {
  name: "inc4b"
  type: "Concat"
  bottom: "inc4b/conv1"
  bottom: "inc4b/conv3_2"
  bottom: "inc4b/conv5_3"
  top: "inc4b"
}

################################################################################
## Inception 4c
################################################################################
layer {
  name: "inc4c/conv1"
  type: "Convolution"
  bottom: "inc4b"
  top: "inc4c/conv1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 128  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4c/conv1/bn"
  type: "BatchNorm"
  bottom: "inc4c/conv1"
  top: "inc4c/conv1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4c/conv1/scale"
  type: "Scale"
  bottom: "inc4c/conv1"
  top: "inc4c/conv1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4c/relu1"
  type: "ReLU"
  bottom: "inc4c/conv1"
  top: "inc4c/conv1"
}
layer {
  name: "inc4c/conv3_1"
  type: "Convolution"
  bottom: "inc4b"
  top: "inc4c/conv3_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4c/conv3_1/bn"
  type: "BatchNorm"
  bottom: "inc4c/conv3_1"
  top: "inc4c/conv3_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4c/conv3_1/scale"
  type: "Scale"
  bottom: "inc4c/conv3_1"
  top: "inc4c/conv3_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4c/relu3_1"
  type: "ReLU"
  bottom: "inc4c/conv3_1"
  top: "inc4c/conv3_1"
}
layer {
  name: "inc4c/conv3_2"
  type: "Convolution"
  bottom: "inc4c/conv3_1"
  top: "inc4c/conv3_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 96  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4c/conv3_2/bn"
  type: "BatchNorm"
  bottom: "inc4c/conv3_2"
  top: "inc4c/conv3_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4c/conv3_2/scale"
  type: "Scale"
  bottom: "inc4c/conv3_2"
  top: "inc4c/conv3_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4c/relu3_2"
  type: "ReLU"
  bottom: "inc4c/conv3_2"
  top: "inc4c/conv3_2"
}
layer {
  name: "inc4c/conv5_1"
  type: "Convolution"
  bottom: "inc4b"
  top: "inc4c/conv5_1"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 16  kernel_size: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4c/conv5_1/bn"
  type: "BatchNorm"
  bottom: "inc4c/conv5_1"
  top: "inc4c/conv5_1"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4c/conv5_1/scale"
  type: "Scale"
  bottom: "inc4c/conv5_1"
  top: "inc4c/conv5_1"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4c/relu5_1"
  type: "ReLU"
  bottom: "inc4c/conv5_1"
  top: "inc4c/conv5_1"
}
layer {
  name: "inc4c/conv5_2"
  type: "Convolution"
  bottom: "inc4c/conv5_1"
  top: "inc4c/conv5_2"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4c/conv5_2/bn"
  type: "BatchNorm"
  bottom: "inc4c/conv5_2"
  top: "inc4c/conv5_2"
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  param { lr_mult: 0  decay_mult: 0 }
  batch_norm_param { use_global_stats: false }
}
layer {
  name: "inc4c/conv5_2/scale"
  type: "Scale"
  bottom: "inc4c/conv5_2"
  top: "inc4c/conv5_2"
  param { lr_mult: 1.0  decay_mult: 0 }
  param { lr_mult: 1.0  decay_mult: 0 }
  scale_param { bias_term: true }
}
layer {
  name: "inc4c/relu5_2"
  type: "ReLU"
  bottom: "inc4c/conv5_2"
  top: "inc4c/conv5_2"
}
layer {
  name: "inc4c/conv5_3"
  type: "Convolution"
  bottom: "inc4c/conv5_2"
  top: "inc4c/conv5_3"
  param { lr_mult: 1.0  decay_mult: 1.0 }
  param { lr_mult: 2.0  decay_mult: 0 }
  convolution_param {
    num_output: 32  kernel_size: 3  pad: 1
    weight_filler { type: "xavier"  std: 0.1 }
    bias_filler { type: "constant"  value: 0.1 }
  }
}
layer {
  name: "inc4c/conv5_3/bn"
  type: "BatchNorm"
  bottom: "inc4c/conv5_3"
